for 256 * 256 videos
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 256, 256, 0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 32, 256, 256, 6016        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 256, 256, 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 32, 256, 256, 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 16, 128, 128, 13856       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 128, 128, 128         conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 16, 128, 128, 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 16, 128, 128, 55360       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 128, 128, 256         conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 16, 128, 128, 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 8, 64, 64, 12 221312      leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 64, 64, 12 512         conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 8, 64, 64, 12 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 8, 64, 64, 25 884992      leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 8, 64, 64, 25 1024        conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 8, 64, 64, 25 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 4, 32, 32, 51 3539456     leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4, 32, 32, 51 2048        conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 4, 32, 32, 51 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 4, 32, 32, 51 7078400     leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 4, 32, 32, 51 2048        conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 4, 32, 32, 51 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 4, 32, 32, 51 7078400     leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 4, 32, 32, 51 2048        conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 4, 32, 32, 51 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 4, 32, 32, 51 7078400     leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4, 32, 32, 51 2048        conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 4, 32, 32, 51 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4, 32, 32, 10 0           leaky_re_lu_9[0][0]              
                                                                 leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 8, 64, 64, 10 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 8, 64, 64, 25 16777472    up_sampling3d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 64, 64, 25 1024        conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 8, 64, 64, 25 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 8, 64, 64, 51 0           leaky_re_lu_10[0][0]             
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 8, 64, 64, 12 1769600     concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 64, 64, 12 512         conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 8, 64, 64, 12 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 16, 128, 128, 0           leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 16, 128, 128, 524352      up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 128, 128, 256         conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 16, 128, 128, 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 16, 128, 128, 0           leaky_re_lu_12[0][0]             
                                                                 leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 16, 128, 128, 110624      concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 128, 128, 128         conv3d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 16, 128, 128, 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 16, 128, 128, 0           leaky_re_lu_13[0][0]             
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 32, 256, 256, 0           concatenate_5[0][0]              
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 32, 256, 256, 65552       up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 256, 256, 64          conv3d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 32, 256, 256, 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 32, 256, 256, 0           leaky_re_lu_14[0][0]             
                                                                 leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 32, 256, 256, 2595        concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 256, 256, 12          conv3d_15[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 256, 256, 0           batch_normalization_15[0][0]     
==================================================================================================
Total params: 45,218,559
Trainable params: 45,212,473
Non-trainable params: 6,086
__________________________________________________________________________________________________

(?, 32, 256, 256, 3)
(?, 32, 256, 256, 16)
(?, 16, 128, 128, 32)
(?, 16, 128, 128, 64)
(?, 8, 64, 64, 128)
(?, 8, 64, 64, 256)
(?, 4, 32, 32, 512)
(?, 4, 32, 32, 512)
(?, 4, 32, 32, 512)
(?, 4, 32, 32, 512)
(?, 8, 64, 64, 256)
(?, 8, 64, 64, 128)
(?, 16, 128, 128, 64)
(?, 16, 128, 128, 32)
(?, 32, 256, 256, 16)
(?, 32, 256, 256, 3)

