__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 8, 160, 120,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 8, 160, 120,  12032       input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 8, 160, 120,  128         conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 8, 160, 120,  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 4, 80, 60, 64 55360       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4, 80, 60, 64 256         conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 4, 80, 60, 64 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 4, 80, 60, 12 221312      leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 4, 80, 60, 12 512         conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 4, 80, 60, 12 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 2, 40, 30, 25 884992      leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 2, 40, 30, 25 1024        conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 2, 40, 30, 25 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 2, 40, 30, 51 3539456     leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 2, 40, 30, 51 2048        conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 2, 40, 30, 51 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 2, 40, 30, 51 7078400     leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 2, 40, 30, 51 2048        conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 2, 40, 30, 51 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 2, 40, 30, 51 7078400     leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 2, 40, 30, 51 2048        conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 2, 40, 30, 51 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 2, 40, 30, 51 7078400     leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 2, 40, 30, 51 2048        conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 2, 40, 30, 51 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 2, 40, 30, 10 0           leaky_re_lu_8[0][0]              
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 2, 40, 30, 25 7078144     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 2, 40, 30, 25 1024        conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 2, 40, 30, 25 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 2, 40, 30, 51 0           leaky_re_lu_9[0][0]              
                                                                 leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 4, 80, 60, 51 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 4, 80, 60, 12 4194432     up_sampling3d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 4, 80, 60, 12 512         conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 4, 80, 60, 12 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 4, 80, 60, 25 0           leaky_re_lu_10[0][0]             
                                                                 leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 4, 80, 60, 64 442432      concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 80, 60, 64 256         conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 4, 80, 60, 64 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 4, 80, 60, 12 0           leaky_re_lu_11[0][0]             
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 8, 160, 120,  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 8, 160, 120,  262176      up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 8, 160, 120,  128         conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 8, 160, 120,  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 8, 160, 120,  0           leaky_re_lu_12[0][0]             
                                                                 leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 8, 160, 120,  5187        concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8, 160, 120,  12          conv3d_13[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 8, 160, 120,  0           batch_normalization_13[0][0]     
==================================================================================================
Total params: 37,942,767
Trainable params: 37,936,745
Non-trainable params: 6,022
__________________________________________________________________________________________________

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 320, 240, 3)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 240, 32) 2432        input_2[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 8, 160, 120,  0                                            
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 320, 240, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
model_1 (Model)                 (None, 8, 160, 120,  37942767    input_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 320, 240, 32) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 160, 120, 24) 0           model_1[1][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 120, 64) 32832       leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 160, 120, 64) 24640       reshape_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 160, 120, 64) 256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 160, 120, 64) 256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 160, 120, 64) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 160, 120, 64) 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 160, 120, 128 0           leaky_re_lu_14[0][0]             
                                                                 leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 160, 120, 160 184480      concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 160, 120, 160 640         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 160, 120, 160 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 60, 256)  368896      leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 80, 60, 256)  1024        conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 80, 60, 256)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 80, 60, 512)  1180160     leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 80, 60, 512)  2048        conv2d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 80, 60, 512)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 40, 30, 512)  2359808     leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 40, 30, 512)  2048        conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 40, 30, 512)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 40, 30, 512)  2359808     leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 40, 30, 512)  2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 40, 30, 512)  0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 40, 30, 512)  2359808     leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 40, 30, 512)  2048        conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 40, 30, 512)  0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 30, 512)  2359808     leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 40, 30, 512)  2048        conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 40, 30, 512)  0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 40, 30, 512)  2359808     leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 40, 30, 512)  2048        conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 40, 30, 512)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 40, 30, 1024) 0           leaky_re_lu_23[0][0]             
                                                                 leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 80, 60, 1024) 0           concatenate_7[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 80, 60, 512)  8389120     up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 80, 60, 512)  2048        conv2d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 80, 60, 512)  0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 80, 60, 1024) 0           leaky_re_lu_24[0][0]             
                                                                 leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 80, 60, 432)  3981744     concatenate_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 80, 60, 432)  1728        conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 80, 60, 432)  0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 80, 60, 688)  0           leaky_re_lu_25[0][0]             
                                                                 leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 160, 120, 688 0           concatenate_9[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 160, 120, 324 3566916     up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 160, 120, 324 1296        conv2d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 160, 120, 324 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 160, 120, 484 0           leaky_re_lu_26[0][0]             
                                                                 leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 160, 120, 243 1058751     concatenate_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 160, 120, 243 972         conv2d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 160, 120, 243 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 160, 120, 371 0           leaky_re_lu_27[0][0]             
                                                                 concatenate_6[0][0]              
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 320, 240, 371 0           concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 320, 240, 131 777747      up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 320, 240, 131 524         conv2d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 320, 240, 131 0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 320, 240, 163 0           leaky_re_lu_28[0][0]             
                                                                 leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 320, 240, 74) 108632      concatenate_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 320, 240, 74) 296         conv2d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 320, 240, 74) 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 320, 240, 3)  2001        leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 320, 240, 3)  12          conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 320, 240, 3)  0           batch_normalization_31[0][0]     
==================================================================================================
Total params: 69,441,626
Trainable params: 69,424,870
Non-trainable params: 16,756
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 8, 160, 120,  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 320, 240, 3)  0                                            
__________________________________________________________________________________________________
model_1 (Model)                 (None, 8, 160, 120,  37942767    input_1[0][0]                    
__________________________________________________________________________________________________
model_2 (Model)                 (None, 320, 240, 3)  69441626    input_2[0][0]                    
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 69,441,626
Trainable params: 69,424,870
Non-trainable params: 16,756
__________________________________________________________________________________________________
